package com.edition5.chapter3.practice;
/*
Напишите цикл for, в котором перебирались бы значения от 1000 до 0 с шагом -2.

 */

public class forTwo {
    public static void main(String[] args) {


        for (int i=1000; i>=0; i--){
            i--;
            System.out.println(i);
        }
    }
}
